Revit 2027 API
Solid.SurfaceArea Property
Returns the total surface area of this solid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double SurfaceArea { get; }
Public ReadOnly Property SurfaceArea As Double
	Get
public:
property double SurfaceArea {
	double get ();
}
member SurfaceArea : float with get
Return Value
Double
The real number equal to the total area of this solid.
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when this solid is not a valid Geometry object.
Remarks
 Calculates the surface area by adding together the areas of faces comprising this solid. Will slightly underestimate if curved surfaces are present.
See Also
Reference
Solid Class
Autodesk.Revit.DB Namespace